
  {
    id: 1,
    title:
      'Agenda 2063 and Its Concept: the African Union has embarked on Implementing this development Agenda',
    date: '10 May 2019',
    body:
      '<p>The vision of Agenda 2063 was launched under the leadership of H.E Dr Nkosazana Dlamini Zuma, First Female Chairperson of the African Union Commission (AUC) since the creation of the OAU now the AU</p>\n' +
      '\n' +
      '<p>Addis Ababa, Ethiopia, 6 May 2016: Agenda 2063, which is part of the pan-African struggles for unity, self-determination, freedom, progress and collective prosperity that started over centuries ago, is a shared framework for inclusive growth and sustainable development to be realized by 2063. It was agreed upon by the African leaders in 2013 during the 50th Anniversary of the Organization of African Unity (OAU); the context in which it should be situated.</p>\n' +
      '\n' +
      '<p>Since 2012, and in preparation for the commemoration of the 50th OAU Anniversary, the AU Heads of State and Government declared 2013 to be the year of Pan-Africanism and African Renaissance. The aim was to provide an opportunity to reflect on its past, re-kindle its ideals and plan for better future of Africa and its people.</p>\n' +
      '\n' +
      '<p>The move was urged by the fact that when the OAU was established in 1963, there were many challenges that had first to be overcome. Almost half of the continent was still under colonialism; relations with regional groupings (now Regional Economic Communities&mdash;RECs) and other institutions, such as the United Nations Economic Commissions, had not been laid down and strengthened, while member states had not been internally well organized. In addition, African countries had no experience in running such first continental organization. Hence, there was no common vision on how to pursue OAU&rsquo;s objectives, particularly the African unity agenda. As a result, there was no clear strategy on how to advance Pan-Africanism and African Renaissance; and many blueprints and plans that the OAU put in place were not well conceived. For instance, they did not include important elements such as reliable sources of funding, constant monitoring and evaluation and so on; the situation that led many of them to be ineffectively executed with undesired results.</p>\n' +
      '\n' +
      '<p>By 2013, the African Union (AU) found itself in a new conducive environment for advancing the socio-economic development and integration of the continent through a long-term planning. By then, colonialism had been greatly defeated and apartheid dismantled. Member states were better organized with major advances in many areas such as good governance and conflict management and resolution. In addition, relations with RECs and other institutions have been improved and the former had been made AU pillars. Above all, member states had agreed on a common vision &ldquo;to build an integrated, prosperous and peaceful Africa, driven and managed by its own citizens and representing a dynamic force in the global arena.&rdquo; Moreover, good experience had been gained from running continental blueprints, like the New Partnership for Africa&rsquo;s Development (NEPAD); and there have emerged other new factors to Africa&rsquo;s advantage. They include development and investment opportunities that had started seeing many African countries economically booming; emergence of new international alliances like BRICS composed of Brazil, Russia, India, China and South Africa; and the general changing universal context of globalization and revolution in information technology etc. Therefore, the AU was better placed to develop a long-term strategy that would harmonize national, regional and continental plans and frameworks to realize its objectives.</p>\n' +
      '\n' +
      '<p>Consequently, in 2013 during the OAU Golden Jubilee, the African leaders adopted the 50th Anniversary Solemn Declaration in which they decided to develop a Continental Agenda 2063 with clear priority areas to be realized in the next fifty years through a people-driven process.</p>\n' +
      '\n' +
      '<p>In overall, Agenda 2063 was intended to be a well-conceived continental plan built on the previous and existing plans from national to continental levels, pursued through new thinking and ways of operation using modern techniques to realize the AU&rsquo;s common vision coming the next fifty years, when the AU member states will be celebrating the OAU Centenary.</p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13605083048.jpg',
      url: 'http://67.205.130.199/photos/shares/5e13b188322df.jpg',
    },
  },
  {
    id: 2,
    title:
      'AU Hosts High Level Side Event on Implementing Agenda 2063 and Agenda 2030 for Sustainable Development',
    date: '24 September 2014',
    body:
      '<p><strong>New York, USA &ndash; 21 September 2016:</strong> The African Union Commission (AUC) today hosted a high level joint side event in conjunction with the UN Economic Commission for Africa (UNECA), NEPAD Planning and Coordinating Agency (NPCA), the African Development Bank (AFDB) and the United Nations Development Programme (UNDP) -Regional Bureau for Africa to discuss the modalities of effecting an integrated approach to implementing Africa&rsquo;s Agenda 2063 and the Global 2030 Agenda.</p>\n' +
      '\n' +
      '<p>The meeting which was held on the side lines of the 71st session of the United Nations General Assembly (UNGA) was chaired by the AUC Deputy Chairperson, H.E. Mr. Erastus Mwencha and was attended by high-ranking government officials, heads of Pan African Organizations, heads of international organisations as well as development partners and key stakeholders.</p>\n' +
      '\n' +
      '<p>In his opening remarks, H.E. Mr. Mwencha highlighted the fact that Africa proactively contributed to the global agenda by formulating a Common African Position (CAP) on the Post 2015 Development Agenda which was preceded by broad consultations across the continent and that Africa was the only region that had developed a document which represented a united African voice in the formulation of the SDGs. This document greatly influenced the work of the Open Working Group on the SDGs and the Intergovernmental Negotiations on the post-2015 development Agenda. As a result, there is a high degree of convergence between the continent&rsquo;s priorities, as embodied in the African Union&rsquo;s Agenda 2063 and the 17 Sustainable Development Goals of Agenda 2030; and this calls for coherent implementation of both agendas by African Member States.&rdquo;</p>\n' +
      '\n' +
      '<p>During the meeting, the Commissioner for Economic Affairs H.E. Dr. Anthony Mothae Maruping moderated a panel of distinguished representatives to discuss various perspectives on implementing Agenda 2063 and Agenda 2030. The panel consisted of representatives from UNECA, AFDB, NEPAD, UNFPA FEMNET UNDP and the UN Office of the Special Adviser on Africa (OSAA)</p>\n' +
      '\n' +
      '<p>Reflecting on the recent trends on the MDGs the Executive Secretary of UNECA Dr. Carlos Lopes called on African States to accelerate efforts to diversify their economies and add value to their primary commodities so as to expand decent employment opportunities for their population.&rdquo; Mr. Alberic Kacou of the AFDB reiterated the Bank&rsquo;s support for the implementation of the two agendas and observed that &ldquo;the institution&rsquo;s priorities as reflected in the High 5s provide substantial leverage for the implementation of the SDGs and Agenda 2063.&rdquo; Mr. Odusola of UNDP Regional Bureau for Africa underlined their &ldquo;commitment to strengthening the capacities of countries to implement the two agendas.&rdquo;</p>\n' +
      '\n' +
      '<p>The meeting concluded with the launch of two reports: the <strong>MDG to Agenda 2063 /SDG Transition Report</strong> <strong>2016 and Africa Economic Outlook Report 2016. </strong>The transition report takes stock of Africa&rsquo;s performance on the MDGs to date and reflects on the challenges and opportunities associated with the transition to Africa&rsquo;s continental Agenda 2063 and the 2030 Agenda for Sustainable Development.</p>\n' +
      '\n' +
      '<p>The transition report also highlights important strides made by the continent in: improving net primary enrolment; enhancing gender equality and empowerment of women; reducing child mortality; combating the spread of HIV and AIDS; and ensuring environmental sustainability.</p>\n' +
      '\n' +
      '<p>To ensure effective implementation of the two Agendas, the transition report highlights the need for countries to strengthen capacities for evidence-based policy-making and to improve institutional coordination.</p>\n',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e13b18879b18.jpg',
    },
  },
  {
    id: 3,
    title:
      'Stakeholder Engagement meeting on ‘Capacity imperatives for Agenda 2063’',
    date: 'May 12, 2016',
    body:
      '<p><strong>Addis Ababa, May 11</strong>: The African Capacity Building Foundation (ACBF) and the African Union Commission (AUC) will hold a Stakeholder Engagement Meeting on 12-13 May 2016 at the African Union Commission HQ, Addis Ababa, Ethiopia themed “Capacity Imperatives for Agenda 2063.”</p><p>The meeting will draw representation from various stakeholders in the capacity development sector including Governments and their development partners.</p><p>Agenda 2063 - “The Africa We Want” is the indigenous African Strategic Framework agreed upon by African Heads of States and Governments through the African Union. The framework was built around seven key aspirations:</p><ul><li>A prosperous Africa, based on inclusive growth and sustainable development;</li><li>An integrated continent politically united and based on the ideals of Pan-Africanism and the vision of an African Renaissance;</li><li>Rule of law;</li><li>A peaceful and secure Africa;</li><li>An Africa with a strong cultural identity, common heritage, values and ethics;</li><li>An Africa whose development is people driven, relying on the potential offered by African people, particularly women and youth, and caring for children;</li><li>An Africa that can stand as a strong and influential global player and partner.</li></ul><p>According to the African Capacity Building Foundation (ACBF), the successful implementation of Agenda 2063 requires a strategic approach that prioritizes key capacity challenges that, if addressed, can unlock the continent’s true potential. Professor Emmanuel Nnadozie the Executive Secretary of ACBF has previously iterated that, “There has been a lack of confidence among some Africans in their capacity to develop the continent. However, development of Africa through partnership and a concerted effort can be achieved.”</p><p>The main purpose of the upcoming workshop will be to examine and validate the major points and recommendations that are emerging from the capacity assessment review documents produced by the ACBF, including (i) Capacity Requirements for Agenda 2063; (ii) African critical technical skills: A key Capacity dimension needed for implementing programmes in the first ten years of Agenda 2063; (iii) Capacity Development Plan Framework. Key findings of the review process include the shortcomings of our education systems; the need for critical technical skills and capacities; and the need for change in institutional architecture and legislative frameworks.</p><p>The Report on the “Capacity Requirements for Agenda 2063” informs that the capacity required for a successful implementation of Agenda 2063 are clustered into four main categories, namely (1) operational capacity for holistic and effective results (this includes institutional and human capacity as well as systems and work processes); (2) change and transformative capacities (which includes transformative leadership, change readiness, ability for mind-set shifts, and ability to innovate); (3) composite capacity (which includes strategic planning, results-based management as well as organizational and coordination capability); and (4) critical, technical and sector-specific skills for implementing the 10 flagship projects under the First Ten Year Implementation Plan of Agenda 2063.</p><p>The study on the “African critical technical skills: A key Capacity dimension needed for implementing programmes in the first ten years of Agenda 2063” shows, among other findings, that:</p><ul><li>in terms of agriculture scientists and researchers, Africa might have a current projected gap of 1,611,042, and a projected number of 1,886,820 to aim for by 2023;</li><li>as a continent, Africa might have a current estimated gap of 2,827,703 water and sanitation engineers; the continent should aim for 3,152,025 by 2023; and</li><li>Africa might have a current projected gap of 7,441,648 engineers, and a projected number of 8,295,163 engineers to aim for by 2023</li></ul><p>The “Capacity Development Plan Framework” suggests that for major agenda of capacity development to take place as part of the implementation of Agenda 2063, it is estimated that 80 percent of the needed capacity development interventions could be initiated and carried out by various stakeholder group actors, while approximately 20 percent maybe placed under the responsibility of continental and regional institutions.</p><p>Prof Nnadozie adds, “The identification of capacity as a key strategic area has been one of the fundamental missing links with previous development efforts. As such, the implementation of Agenda 2063 will be based on a proper understanding of the capacity requirements and accompanied by a Capacity Development Planning Framework.”</p><p>The upcoming workshop will also deliberate on actionable decisions to be made as well as activities to be undertaken by key stakeholder groups for effective execution of a 10 year implementation plan of Agenda 2063.</p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e226ad56b9ee.jpg',
    },
  },

  {
    id: 4,
    title:
      'Agenda 2063 and Its Concept: the African Union has embarked on Implementing this development Agenda',
    date: 'May 10, 2016',
    body:
      '<p>The vision of Agenda 2063 was launched under the leadership of H.E Dr Nkosazana Dlamini Zuma, First Female Chairperson of the African Union Commission (AUC) since the creation of the OAU now the AU</p><p>Addis Ababa, Ethiopia, 6 May 2016: Agenda 2063, which is part of the pan-African struggles for unity, self-determination, freedom, progress and collective prosperity that started over centuries ago, is a shared framework for inclusive growth and sustainable development to be realized by 2063. It was agreed upon by the African leaders in 2013 during the 50th Anniversary of the Organization of African Unity (OAU); the context in which it should be situated.</p><p>Since 2012, and in preparation for the commemoration of the 50th OAU Anniversary, the AU Heads of State and Government declared 2013 to be the year of Pan-Africanism and African Renaissance. The aim was to provide an opportunity to reflect on its past, re-kindle its ideals and plan for better future of Africa and its people.</p><p>The move was urged by the fact that when the OAU was established in 1963, there were many challenges that had first to be overcome. Almost half of the continent was still under colonialism; relations with regional groupings (now Regional Economic Communities—RECs) and other institutions, such as the United Nations Economic Commissions, had not been laid down and strengthened, while member states had not been internally well organized. In addition, African countries had no experience in running such first continental organization. Hence, there was no common vision on how to pursue OAU’s objectives, particularly the African unity agenda. As a result, there was no clear strategy on how to advance Pan-Africanism and African Renaissance; and many blueprints and plans that the OAU put in place were not well conceived. For instance, they did not include important elements such as reliable sources of funding, constant monitoring and evaluation and so on; the situation that led many of them to be ineffectively executed with undesired results.</p><p>By 2013, the African Union (AU) found itself in a new conducive environment for advancing the socio-economic development and integration of the continent through a long-term planning. By then, colonialism had been greatly defeated and apartheid dismantled. Member states were better organized with major advances in many areas such as good governance and conflict management and resolution. In addition, relations with RECs and other institutions have been improved and the former had been made AU pillars. Above all, member states had agreed on a common vision “to build an integrated, prosperous and peaceful Africa, driven and managed by its own citizens and representing a dynamic force in the global arena.” Moreover, good experience had been gained from running continental blueprints, like the New Partnership for Africa’s Development (NEPAD); and there have emerged other new factors to Africa’s advantage. They include development and investment opportunities that had started seeing many African countries economically booming; emergence of new international alliances like BRICS composed of Brazil, Russia, India, China and South Africa; and the general changing universal context of globalization and revolution in information technology etc. Therefore, the AU was better placed to develop a long-term strategy that would harmonize national, regional and continental plans and frameworks to realize its objectives.</p><p>Consequently, in 2013 during the OAU Golden Jubilee, the African leaders adopted the 50th Anniversary Solemn Declaration in which they decided to develop a Continental Agenda 2063 with clear priority areas to be realized in the next fifty years through a people-driven process.</p><p>In overall, Agenda 2063 was intended to be a well-conceived continental plan built on the previous and existing plans from national to continental levels, pursued through new thinking and ways of operation using modern techniques to realize the AU’s common vision coming the next fifty years, when the AU member states will be celebrating the OAU Centenary.</p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e226ac1cf4ca.jpg',
    },
  },

  {
    id: 5,
    title:
      'Agenda 2063 and Its Concept: the African Union has embarked on Implementing this development Agenda',
    date: 'May 10, 2016',
    body:
      '<p>The vision of Agenda 2063 was launched under the leadership of H.E Dr Nkosazana Dlamini Zuma, First Female Chairperson of the African Union Commission (AUC) since the creation of the OAU now the AU</p><p>Addis Ababa, Ethiopia, 6 May 2016: Agenda 2063, which is part of the pan-African struggles for unity, self-determination, freedom, progress and collective prosperity that started over centuries ago, is a shared framework for inclusive growth and sustainable development to be realized by 2063. It was agreed upon by the African leaders in 2013 during the 50th Anniversary of the Organization of African Unity (OAU); the context in which it should be situated.</p><p>Since 2012, and in preparation for the commemoration of the 50th OAU Anniversary, the AU Heads of State and Government declared 2013 to be the year of Pan-Africanism and African Renaissance. The aim was to provide an opportunity to reflect on its past, re-kindle its ideals and plan for better future of Africa and its people.</p><p>The move was urged by the fact that when the OAU was established in 1963, there were many challenges that had first to be overcome. Almost half of the continent was still under colonialism; relations with regional groupings (now Regional Economic Communities—RECs) and other institutions, such as the United Nations Economic Commissions, had not been laid down and strengthened, while member states had not been internally well organized. In addition, African countries had no experience in running such first continental organization. Hence, there was no common vision on how to pursue OAU’s objectives, particularly the African unity agenda. As a result, there was no clear strategy on how to advance Pan-Africanism and African Renaissance; and many blueprints and plans that the OAU put in place were not well conceived. For instance, they did not include important elements such as reliable sources of funding, constant monitoring and evaluation and so on; the situation that led many of them to be ineffectively executed with undesired results.</p><p>By 2013, the African Union (AU) found itself in a new conducive environment for advancing the socio-economic development and integration of the continent through a long-term planning. By then, colonialism had been greatly defeated and apartheid dismantled. Member states were better organized with major advances in many areas such as good governance and conflict management and resolution. In addition, relations with RECs and other institutions have been improved and the former had been made AU pillars. Above all, member states had agreed on a common vision “to build an integrated, prosperous and peaceful Africa, driven and managed by its own citizens and representing a dynamic force in the global arena.” Moreover, good experience had been gained from running continental blueprints, like the New Partnership for Africa’s Development (NEPAD); and there have emerged other new factors to Africa’s advantage. They include development and investment opportunities that had started seeing many African countries economically booming; emergence of new international alliances like BRICS composed of Brazil, Russia, India, China and South Africa; and the general changing universal context of globalization and revolution in information technology etc. Therefore, the AU was better placed to develop a long-term strategy that would harmonize national, regional and continental plans and frameworks to realize its objectives.</p><p>Consequently, in 2013 during the OAU Golden Jubilee, the African leaders adopted the 50th Anniversary Solemn Declaration in which they decided to develop a Continental Agenda 2063 with clear priority areas to be realized in the next fifty years through a people-driven process.</p><p>In overall, Agenda 2063 was intended to be a well-conceived continental plan built on the previous and existing plans from national to continental levels, pursued through new thinking and ways of operation using modern techniques to realize the AU’s common vision coming the next fifty years, when the AU member states will be celebrating the OAU Centenary.</p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e226e4bab8ed.jpg',
    },
  },

  {
    id: 6,
    title:
      'Agenda 2063 and Its Concept: the African Union has embarked on Implementing this development Agenda',
    date: 'May 10, 2016',
    body:
      '<p><strong>Addis Ababa, Ethiopia, 07 December 2015</strong>: Experts from across the Continent have convened today, 07 December 2015 at the African Union headquarters in Addis Ababa, Ethiopia to review the Agenda 2063 First Ten Year Implementation Plan measurement Framework. The three-day meeting will provide an opportunity to statisticians, planners, academicians, development partners as well as representatives of the civil society to identify and recommend core indicators that will facilitate the domestication and implementation of the new Africa’s development framework.</p><p>Addressing the meeting during the opening ceremony on behalf of the African Union Chairperson, H.E Dr. Nkosazana Dlamini-Zuma, Dr. Réné Kouassi N’Guettia, Director for Economic Affairs, recalled that the African leadership adopted the Agenda 2063 and its First Ten Tear Implementation Plan to achieve the Pan-African vision of an integrated, prosperous and peaceful Africa. He further argued that in order to translate into action the different aspirations of Agenda 2063, Africa should be able to define clear indicators to monitor and evaluate the progress in implementing the Agenda. Moreover, he added that participants will identify challenges, propose new indicators and make amendments, if necessary. “Experts will also agree on a consensus on source of data, as well as, the Core Indicators that Member States will have to report to the Regional Economic Communities.” said the Director.</p><p>This meeting was preceded by another meeting that took place in Nairobi from 16 to 18th November for the Development of a Roadmap for the Convergence of AUC/AFDB/UNECA and RECS Monitoring and Evaluation Systems for The First Ten Year Implementation Plan of Agenda 2063. The outcomes will be presented next in South Africa during the meeting to cost the indicators.</p><p><strong>About Africa’s Agenda 2063</strong></p><p>Agenda 2063 was adopted by the 24th Ordinary Session of the AU Assembly on the 31 January 2015 as is anchored on the AU Constitutive Act, the Pan African vision of “an integrated, prosperous and peaceful Africa, driven by its own citizens and representing a dynamic force in the international arena”, the 50th Anniversary Solemn Declaration 2013 as well as the national, regional and continental priorities. The First Ten-Year Implementation Plan for Agenda 2063 builds upon the Agenda 2063 Framework Document adopted in January 2015, and seeks to accelerate Africa’s political, social, economic and technological transformation while continuing the Pan African drive for self-determination, freedom, progress and collective prosperity.</p><p>For more information on Agenda 2063, please visit: <a href="http://agenda2063.au.int/" target="_blank">Agenda 2063 Website</a></p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e226acb61435.jpg',
    },
  },
  {
    id: 7,
    title:
      'Women’s Leadership at All Levels Crucial for Implementing Agenda 2063 and the 2030 Agenda',
    date: 'January 29, 2018',
    body:
      '<p><strong>Addis Ababa, Ethiopia, 07 December 2015</strong>: Experts from across the Continent have convened today, 07 December 2015 at the African Union headquarters in Addis Ababa, Ethiopia to review the Agenda 2063 First Ten Year Implementation Plan measurement Framework. The three-day meeting will provide an opportunity to statisticians, planners, academicians, development partners as well as representatives of the civil society to identify and recommend core indicators that will facilitate the domestication and implementation of the new Africa’s development framework.</p><p>Addressing the meeting during the opening ceremony on behalf of the African Union Chairperson, H.E Dr. Nkosazana Dlamini-Zuma, Dr. Réné Kouassi N’Guettia, Director for Economic Affairs, recalled that the African leadership adopted the Agenda 2063 and its First Ten Tear Implementation Plan to achieve the Pan-African vision of an integrated, prosperous and peaceful Africa. He further argued that in order to translate into action the different aspirations of Agenda 2063, Africa should be able to define clear indicators to monitor and evaluate the progress in implementing the Agenda. Moreover, he added that participants will identify challenges, propose new indicators and make amendments, if necessary. “Experts will also agree on a consensus on source of data, as well as, the Core Indicators that Member States will have to report to the Regional Economic Communities.” said the Director.</p><p>This meeting was preceded by another meeting that took place in Nairobi from 16 to 18th November for the Development of a Roadmap for the Convergence of AUC/AFDB/UNECA and RECS Monitoring and Evaluation Systems for The First Ten Year Implementation Plan of Agenda 2063. The outcomes will be presented next in South Africa during the meeting to cost the indicators.</p><p><strong>About Africa’s Agenda 2063</strong></p><p>Agenda 2063 was adopted by the 24th Ordinary Session of the AU Assembly on the 31 January 2015 as is anchored on the AU Constitutive Act, the Pan African vision of “an integrated, prosperous and peaceful Africa, driven by its own citizens and representing a dynamic force in the international arena”, the 50th Anniversary Solemn Declaration 2013 as well as the national, regional and continental priorities. The First Ten-Year Implementation Plan for Agenda 2063 builds upon the Agenda 2063 Framework Document adopted in January 2015, and seeks to accelerate Africa’s political, social, economic and technological transformation while continuing the Pan African drive for self-determination, freedom, progress and collective prosperity.</p><p>For more information on Agenda 2063, please visit: <a href="http://agenda2063.au.int/" target="_blank">Agenda 2063 Website</a></p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e22705fc9ac1.jpg',
    },
  },
  {
    id: 8,
    title:
      'Agenda 2063: AUC Chairperson Calls on Cameroonian Editors to Contribute in Telling the True Story of Africa for a Prosperous and Peaceful Continent',
    date: 'November 24, 2016',
    body:
      '<p><strong>Yaoundé, 24 November 2016</strong>: - The Chairperson of the African Union Commission (AUC), H.E Dr. Nkosazana Dlamini Zuma, met with Cameroonian Editors while on a brief visit in the country on 24 November 2016 within the framework of the ongoing AFCON to boost women footballers.</p><p>The meeting with the Editors started with a minute of silence in memory of the former Secretary General of the Organisation of African Unity (OAU), William Eteki Mboumoua, who passed away recently and whose corps was being removed from the Yaoundé General Hospital on 24 November 2016. Another minute of silence was for the victims of the recent train tragedy in Ezeka, Cameroon.</p><p>The AUC Chairperson then signed the condolence book for the late Mr. William Eteki Mboumoua in the presence of Dr. Sidiki M. Kaloko, Commissioner for Social Affairs of the AUC and H.E Mr. Issa Tchiroma Bakarry, Minister of Communication of the Republic of Cameroon, before engaging the media professionals in a heated debate.</p><p>&nbsp;Dr. Dlamini-Zuma urged the Cameroonian Editors to fully engage in shaping the African narrative by telling the true story about Africa. She invited the journalists to play their rightful roles in popularising Agenda 2063 and be part of the development process of the continent. Worth noting that, the meeting between the AUC Chairperson and the Cameroonian Editors was a follow-up of the outcome of the two African Editors meeting held in Kigali, Rwanda and in Pretoria, South Africa which was aimed at creating a platform for Editors to exchange and interact with the AUC leadership with the view to encourage an inclusive participation in the implementation of Agenda 2063. She emphasized that the media professionals have an important role to play in the popularization of Agenda 2063.</p><p>Dr. Dlamini Zuma seized the opportunity to inform the Editors about her visit in Cameroon during the AFCON. She said wants to pass on messages of encouragement to the young female football players and ask them to be role models for the future generation. She recalled that the African Union and the Confederation of African Football (CAF) have signed a partnership agreement to use sports as a galvanizing tool for social cohesion and unity. It will also serve as a platform to promote the African Union campaign on “Ending Child Marriage” as well as the importance of educating the girl child and empowering the African women in general.</p><p>According to the Cameroonian Minister of Communication, Cameroon is a country of freedom of expression hosting several news agencies, about 200 radios and about thirty television channels. Minister Tchiroma said the presence of the AUC Chairperson in Cameroon was very important as it will boost the spirit of the young female footballers taking part in the AFCON. He welcomed the AUC Chairperson and expressed appreciation to her interest in meeting with the Cameroonian Editors to remind them of their role in contributing in the construction of the “Africa We Want”.</p><p>Ms. Jeanine FANKAM, Reporter in Cameroon - Tribune and focal point of the media professionals, thanked the AUC Chairperson for the consideration given to communication during her mandate, making it one of her eight priorities in the AU Commission. “In its march towards modernization, this tool would give the necessary visibility to Agenda 2063, the springboard towards achieving the projected objectives within a 50-year horizon” she noted. She also recalled that it was in Cameroon that the African Union launched the first consultative meeting with media professionals to brainstorm on the Agenda 2063 framework document which was later adopted by the Heads of State and Government of the AU.</p><p>The question-and-answer session during the meeting with the editors was addressed by the AUC Commissioner for Social Affairs. Dr. Kaloko appreciated the interest by the journalists to join efforts in the implementation of Agenda 2063.</p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e22740213d9a.jpg',
    },
  },

  {
    id: 9,
    title:
      'Africa urged to show a unified sense of purpose by financing Agenda 2063 and the SDGs',
    date: 'April 07, 2016',
    body:
      '<p><strong>Addis Ababa, Ethiopia, 5th April 2016</strong> - H.E Mr. Erastus Mwencha, Deputy Chairperson of the African Union Commission is challenging African member States to demonstrate commitment in developing financing mechanisms towards the implementation of Agenda 2063 and the United Nations Agenda 2030; the Sustainable development Goals. Speaking during the “9th Joint Annual Meetings of the African Union Specialized Technical Committee on Finance, Monetary Affairs, Economic Planning and Integration and the ECA Conference of African Ministers of Finance, Planning and Economic Development”- Round table on Financing, the Deputy Chairperson noted that a harmonized financing of both the Agenda 2063 and the SDGs provides Africa with a unique environment to optimize the opportunities presented by the collective development Africa.</p><p>Though cognizant of the challenge of finding a formula for a holistic financing mechanism for sustainable development to realize the ambitions of Agenda 2063 and SDGs, H.E Mr. Mwencha called on Africa to focus on increasing investments to support job creation, food security and industrialization, as the key elements of sustainable development.</p><p>The Deputy Chairperson outlined potential mechanisms for financing Africa’s development, emphasizing among other issues; the enhancement of the domestic environment for attracting investments through the development of continental risk mitigation mechanisms such as the African Unions African Trade Insurance Agency and the African Risk Capacity. The two institutions, he noted, provide assurance against political risks, credit and investment insurance which are key in reducing the cost of doing business in <strong>Africa</strong>.</p><p>In the area of investments, His Excellency highlighted that over the last 15 years, Africa has experienced a steady decline in Foreign Direct Investments however, this can be addressed if Africa was keen on mobilizing domestic Financing by putting in place policies that encourage the flow of the Foreign Direct Investments into industrialization for transformation.</p><p>H.E Mr. Mwencha says developing continental capital markets to scale up support for industrialization is key for realization of substantial revenues. This he says should be backed by continental legal and regulatory frameworks for integrated payment systems to reduce transaction costs. This would be complimented by strong effective regional regulatory bodies, to facilitate the implementation of trans-boundary projects. H.E Mr. Mwencha underscores that this relies heavily on commitments from African governments.</p><p>The Deputy Chairperson also called for the establishment of special instruments for financing regional projects, noting that there currently exists no instrument for financing regional projects. The lack of Special Purpose Vehicles, he observed, impedes the implementation of regional projects, beneficial for continental development</p><p>Curbing illicit financial flows through which Africa loses about USD 50 billion annually also provides the much sought economic and human development in Africa. H.E Mr. Mwencha stressed the need to work with foreign governments and corporations to track and reduce the illicit financial flows.</p><p>Other financing opportunities available for exploration to finance the implementation of Agenda 2063 and the Sustainable development Goals are, tapping into the international instruments and reserves by encouraging sovereign wealth holders such as China, Norway, the Gulf States, Russia and Singapore to invest directly in Africa within a mutually beneficial framework. Also, mobilizing Remittances for development, which have increased over the past decade to about USD 21 billion to fuel consumption within the social sectors. In this regard, Africa needs to relook and address the cost of remittances and transform the way they are invested to spur entrepreneurship and development.</p><p>The implementation of <strong>Agenda 2063</strong> development framework, having been drawn largely from the National aspirations of 35 African countries, provides a great opportunity for enhanced alignment of national aspirations to the continental goals. A coherent implementation of the Pan African Agenda with the SDGs therefore calls for commitment by members states to finance harmonized implementation of both frameworks</p>',
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e226ac22c9ee.jpg',
    },
  },

  {
    id: 10,
    title:
      'Girls’ education, child protection: UNICEF carves niche in Africa’s Agenda 2063',
    date: 'March 15, 2016',
    body:
      "<p><strong>Addis Ababa, Ethiopia - 15 March 2016</strong>: The Executive Director of the United Nations Children's Fund (UNICEF), Mr. Anthony Lake, has expressed UNICEF's full commitment and support to work with the African Union on the education of girls and protection of children within the framework of Africa's Agenda 2063. The UNICEF Executive and the African Union Commission Chairperson, Dr. Nkosazana Dlamini Zuma, agreed on these focus areas when they met at the AU Headquarters in Addis Ababa, Ethiopia, on Tuesday 15 March 2016.</p><p>The UNICEF Executive Director said that he was very impressed with Agenda 2063, which he noted was in sync with the Sustainable Development Goals, Agenda 2030. “Africa's Agenda 2063 provides an opportunity for the transformation of two generations of girls in Africa,” Mr. Anthony Lake noted, lauding Dr. Dlamini Zuma's leadership on human rights, particularly on girls' rights, including the right to education.</p><p>“Girls' education on the continent is very critical. We know the benefits of educated children to families and societies at large. Girls education is paramount, and therefore needs a lot of emphasis.” The AU Commission Chairperson said, adding that, girls should also be assisted beyond basic education so that they can proceed to higher education. “Primary education is important, but no country has developed with primary education alone,” she noted.</p><p>Aside from girls' education, they also discussed the need to focus on nutrition to ensure proper early child growth, as well as give more attention to the protection of children in conflicts. Concurring with the UNICEF Executive Director, the AUC Chairperson highlighted the importance of focusing on the protection of both children and their mothers. This will protect girls from being made wives and boys from being soldiers when they are meant to be just children.</p><p>They two leaders agreed that AU and UNICEF will strengthen their partnership by developing and implementing a programme plan of action around Agenda 2063 across the continent in the coming years.</p>",
    image: {
      thumb: 'http://67.205.130.199/photos/shares/thumbs/5e13b18879b18.jpg',
      url: 'http://67.205.130.199/photos/shares/5e226acb61435.jpg',
    },
  },
];
