{
    "id":1,
    "title":"Agenda 2063 and Its Concept: the African Union has embarked on Implementing this development Agenda",
    "date":"10 May 2019",
    "body":"<p>The vision of Agenda 2063 was launched under the leadership of H.E Dr Nkosazana Dlamini Zuma, First Female Chairperson of the African Union Commission (AUC) since the creation of the OAU now the AU</p>\n""+""\n""+""<p>Addis Ababa, Ethiopia, 6 May 2016: Agenda 2063, which is part of the pan-African struggles for unity, self-determination, freedom, progress and collective prosperity that started over centuries ago, is a shared framework for inclusive growth and sustainable development to be realized by 2063. It was agreed upon by the African leaders in 2013 during the 50th Anniversary of the Organization of African Unity (OAU); the context in which it should be situated.</p>\n""+""\n""+""<p>Since 2012, and in preparation for the commemoration of the 50th OAU Anniversary, the AU Heads of State and Government declared 2013 to be the year of Pan-Africanism and African Renaissance. The aim was to provide an opportunity to reflect on its past, re-kindle its ideals and plan for better future of Africa and its people.</p>\n""+""\n""+""<p>The move was urged by the fact that when the OAU was established in 1963, there were many challenges that had first to be overcome. Almost half of the continent was still under colonialism; relations with regional groupings (now Regional Economic Communities&mdash;RECs) and other institutions, such as the United Nations Economic Commissions, had not been laid down and strengthened, while member states had not been internally well organized. In addition, African countries had no experience in running such first continental organization. Hence, there was no common vision on how to pursue OAU&rsquo;s objectives, particularly the African unity agenda. As a result, there was no clear strategy on how to advance Pan-Africanism and African Renaissance; and many blueprints and plans that the OAU put in place were not well conceived. For instance, they did not include important elements such as reliable sources of funding, constant monitoring and evaluation and so on; the situation that led many of them to be ineffectively executed with undesired results.</p>\n""+""\n""+""<p>By 2013, the African Union (AU) found itself in a new conducive environment for advancing the socio-economic development and integration of the continent through a long-term planning. By then, colonialism had been greatly defeated and apartheid dismantled. Member states were better organized with major advances in many areas such as good governance and conflict management and resolution. In addition, relations with RECs and other institutions have been improved and the former had been made AU pillars. Above all, member states had agreed on a common vision &ldquo;to build an integrated, prosperous and peaceful Africa, driven and managed by its own citizens and representing a dynamic force in the global arena.&rdquo; Moreover, good experience had been gained from running continental blueprints, like the New Partnership for Africa&rsquo;s Development (NEPAD); and there have emerged other new factors to Africa&rsquo;s advantage. They include development and investment opportunities that had started seeing many African countries economically booming; emergence of new international alliances like BRICS composed of Brazil, Russia, India, China and South Africa; and the general changing universal context of globalization and revolution in information technology etc. Therefore, the AU was better placed to develop a long-term strategy that would harmonize national, regional and continental plans and frameworks to realize its objectives.</p>\n""+""\n""+""<p>Consequently, in 2013 during the OAU Golden Jubilee, the African leaders adopted the 50th Anniversary Solemn Declaration in which they decided to develop a Continental Agenda 2063 with clear priority areas to be realized in the next fifty years through a people-driven process.</p>\n""+""\n""+""<p>In overall, Agenda 2063 was intended to be a well-conceived continental plan built on the previous and existing plans from national to continental levels, pursued through new thinking and ways of operation using modern techniques to realize the AU&rsquo;s common vision coming the next fifty years, when the AU member states will be celebrating the OAU Centenary.</p>",
}
